In [1]:
#Importing the required libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
#Loading the dataset
df = pd.read_csv("data/estimated_cases.csv")

In [3]:
df.head()

,GHO (CODE),GHO (DISPLAY),GHO (URL),PUBLISHSTATE (CODE),PUBLISHSTATE (DISPLAY),PUBLISHSTATE (URL),YEAR (CODE),YEAR (DISPLAY),YEAR (URL),REGION (CODE),...,COUNTRY (CODE),COUNTRY (DISPLAY),COUNTRY (URL),Display Value,Numeric,Low,High,StdErr,StdDev,Comments
0,MALARIA_EST_CASES,Estimated number of malaria cases,https://www.who.int/data/gho/indicator-metadat...,PUBLISHED,Published,NaN,2012,2012,NaN,EUR,...,KGZ,Kyrgyzstan,NaN,0,0.0,NaN,NaN,NaN,NaN,NaN
1,MALARIA_EST_CASES,Estimated number of malaria cases,https://www.who.int/data/gho/indicator-metadat...,PUBLISHED,Published,NaN,2008,2008,NaN,AMR,...,SUR,Suriname,NaN,2 086,2086.0,NaN,NaN,NaN,NaN,NaN
2,MALARIA_EST_CASES,Estimated number of malaria cases,https://www.who.int/data/gho/indicator-metadat...,PUBLISHED,Published,NaN,2006,2006,NaN,AMR,...,ECU,Ecuador,NaN,9 863,9863.0,NaN,NaN,NaN,NaN,NaN
3,MALARIA_EST_CASES,Estimated number of malaria cases,https://www.who.int/data/gho/indicator-metadat...,PUBLISHED,Published,NaN,2014,2014,NaN,SEAR,...,LKA,Sri Lanka,NaN,0,0.0,NaN,NaN,NaN,NaN,NaN
4,MALARIA_EST_CASES,Estimated number of malaria cases,https://www.who.int/data/gho/indicator-metadat...,PUBLISHED,Published,NaN,2005,2005,NaN,AMR,...,SLV,El Salvador,NaN,67,67.0,NaN,NaN,NaN,NaN,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2372 entries, 0 to 2371
Data columns (total 22 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   GHO (CODE)              2372 non-null   object
 1   GHO (DISPLAY)           2372 non-null   object
 2   GHO (URL)               2372 non-null   object
 3   PUBLISHSTATE (CODE)     2372 non-null   object
 4   PUBLISHSTATE (DISPLAY)  2372 non-null   object
 5   PUBLISHSTATE (URL)      0 non-null      float64
 6   YEAR (CODE)             2372 non-null   int64
 7   YEAR (DISPLAY)          2372 non-null   int64
 8   YEAR (URL)              0 non-null      float64
 9   REGION (CODE)           2333 non-null   object
 10  REGION (DISPLAY)        2333 non-null   object
 11  REGION (URL)            0 non-null      float64
 12  COUNTRY (CODE)          2372 non-null   object
 13  COUNTRY (DISPLAY)       2372 non-null   object
 14  COUNTRY (URL)           0 non-null      float64
 15  Display Value           2372 non-null   object
 16  Numeric                 2372 non-null   float64
 17  Low                     1565 non-null   float64
 18  High                    1565 non-null   float64
 19  StdErr                  0 non-null      float64
 20  StdDev                  0 non-null      float64
 21  Comments                0 non-null      float64
dtypes: float64(10), int64(2), object(10)
memory usage: 407.8+ KB

In [5]:
#Summary of the statistics of the data
df.describe()

,PUBLISHSTATE (URL),YEAR (CODE),YEAR (DISPLAY),YEAR (URL),REGION (URL),COUNTRY (URL),Numeric,Low,High,StdErr,StdDev,Comments
count,0.0,2372.000000,2372.000000,0.0,0.0,0.0,2.372000e+03,1.565000e+03,1.565000e+03,0.0,0.0,0.0
mean,NaN,2010.508010,2010.508010,NaN,NaN,NaN,2.238404e+06,2.488876e+06,4.603921e+06,NaN,NaN,NaN
std,NaN,6.338905,6.338905,NaN,NaN,NaN,6.574654e+06,6.148587e+06,1.006841e+07,NaN,NaN,NaN
min,NaN,2000.000000,2000.000000,NaN,NaN,NaN,0.000000e+00,0.000000e+00,0.000000e+00,NaN,NaN,NaN
25%,NaN,2005.000000,2005.000000,NaN,NaN,NaN,7.390000e+02,3.300000e+04,7.000000e+04,NaN,NaN,NaN
50%,NaN,2011.000000,2011.000000,NaN,NaN,NaN,5.002850e+04,4.370000e+05,1.200000e+06,NaN,NaN,NaN
75%,NaN,2016.000000,2016.000000,NaN,NaN,NaN,1.596863e+06,2.372000e+06,4.850000e+06,NaN,NaN,NaN
max,NaN,2021.000000,2021.000000,NaN,NaN,NaN,6.539950e+07,5.180000e+07,8.900000e+07,NaN,NaN,NaN

In [6]:
df.columns

Index(['GHO (CODE)', 'GHO (DISPLAY)', 'GHO (URL)', 'PUBLISHSTATE (CODE)',
       'PUBLISHSTATE (DISPLAY)', 'PUBLISHSTATE (URL)', 'YEAR (CODE)',
       'YEAR (DISPLAY)', 'YEAR (URL)', 'REGION (CODE)', 'REGION (DISPLAY)',
       'REGION (URL)', 'COUNTRY (CODE)', 'COUNTRY (DISPLAY)', 'COUNTRY (URL)',
       'Display Value', 'Numeric', 'Low', 'High', 'StdErr', 'StdDev',
       'Comments'],
      dtype='object')

In [7]:
#Check for duplicate rows
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2367    False
2368    False
2369    False
2370    False
2371    False
Length: 2372, dtype: bool

In [11]:
#Specify the columns that are to be dropped
columns_to_drop = ['GHO (CODE)', 'GHO (DISPLAY)', 'GHO (URL)', 'PUBLISHSTATE (CODE)', 'PUBLISHSTATE (DISPLAY)', 'PUBLISHSTATE (URL)', 'YEAR (CODE)', 'YEAR (URL)', 'REGION (CODE)', 'REGION (URL)', 'COUNTRY (CODE)', 'COUNTRY (URL)', 'Display Value', 'Low', 'High', 'StdErr', 'StdDev', 'Comments']

In [12]:
#Drop the specified columns and create a new dataframe
df = df[[col for col in df.columns if col not in columns_to_drop]]

In [14]:
df.columns

Index(['YEAR (DISPLAY)', 'REGION (DISPLAY)', 'COUNTRY (DISPLAY)', 'Numeric'], dtype='object')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2372 entries, 0 to 2371
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   YEAR (DISPLAY)     2372 non-null   int64
 1   REGION (DISPLAY)   2333 non-null   object
 2   COUNTRY (DISPLAY)  2372 non-null   object
 3   Numeric            2372 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 74.3+ KB

In [16]:
# Removing rows with null values. Here the Region column has the null values
df.dropna(subset=['REGION (DISPLAY)'], inplace=True)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2333 entries, 0 to 2371
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   YEAR (DISPLAY)     2333 non-null   int64
 1   REGION (DISPLAY)   2333 non-null   object
 2   COUNTRY (DISPLAY)  2333 non-null   object
 3   Numeric            2333 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 91.1+ KB

In [19]:
# Create a dictionary to specify the mapping of old column names to new column names
column_mapping = {
    'YEAR (DISPLAY)': 'Year',
    'REGION (DISPLAY)': 'Region',
    'COUNTRY (DISPLAY)': 'Country',
    'Numeric': 'Cases',
}

# Use the rename() function to rename the columns
df.rename(columns=column_mapping, inplace=True)

In [21]:
# Convert 'Year' to datetime
df['Year'] = pd.to_datetime(df['Year'], format='%Y')
df['Year'] = df['Year'].dt.year

In [23]:
# Use astype to convert the "Cases" column to an integer
df['Cases'] = df['Cases'].astype(int)

In [24]:
df.head()

   Year           Region      Country  Cases
0  2012           Europe   Kyrgyzstan      0
1  2008         Americas     Suriname   2086
2  2006         Americas      Ecuador   9863
3  2014  South-East Asia    Sri Lanka      0
4  2005         Americas  El Salvador     67

In [25]:
# Create a estimated_cases table with the selected columns
estimated_cases_table = df[['Year', 'Region', 'Country', 'Cases']].copy()
# Add a new column 'case_id' and set it as the index
estimated_cases_table['case_id'] = range(1, len(estimated_cases_table) + 1)
# Reorder the columns to have 'case_id' as the first column
estimated_cases_table = estimated_cases_table[['case_id', 'Year', 'Region', 'Country', 'Cases']]

In [26]:
estimated_cases_table

      case_id  Year           Region      Country   Cases
0           1  2012           Europe   Kyrgyzstan       0
1           2  2008         Americas     Suriname    2086
2           3  2006         Americas      Ecuador    9863
3           4  2014  South-East Asia    Sri Lanka       0
4           5  2005         Americas  El Salvador      67
...       ...   ...              ...          ...     ...
2367     2329  2004  South-East Asia   Bangladesh  101645
2368     2330  2005  South-East Asia   Bangladesh  103199
2369     2331  2009  South-East Asia   Bangladesh   80603
2370     2332  2010  Western Pacific      Vanuatu   20972
2371     2333  2020  South-East Asia        Nepal     244

[2333 rows x 5 columns]